Repository: Kostenkov-2021/screenshots-Russian-locale
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Screenshots Wizard
ru: Мастер создания скриншотов

source: Cancelled
ru: Отменено

source: Please disable screen curtain before take a screenshot
ru: Пожалуйста, отключите затемнение экрана, прежде чем делать снимок экрана

source: Launch the screenshots wizard. A layer of keyboard commands will be activated. Use enter key to take a screenshot, escape to cancel. See documentation for know more commands.
ru: Запускает мастер создания скриншотов. Будет активирован слой клавиатурных команд. Используйте клавишу Enter для создания скриншота, escape - для отмены. Дополнительные команды см. в документации.

source: Folder not found
ru: Папка не найдена

source: Open the folder where the screenshots are stored.
ru: Открыть папку, в которой хранятся скриншоты.

source: No screenshot has been taken yet.
ru: Скриншот ещё не сделан.

source: File not found
ru: Файл не найден

source: Open the last screenshot file in the default app.
ru: Открыть последний скриншот в приложении по умолчанию.

source: Take a full screenshot directly, bypassing the keyboard command layer
ru: Сделать снимок всего экрана напрямую, минуя слой клавиатурных команд

source: Take a screenshot of focused object directly, bypassing the keyboard command layer
ru: Сделать снимок экрана объекта в фокусе напрямую, минуя слой клавиатурных команд

source: Take a screenshot of current window directly, bypassing the keyboard command layer
ru: Сделать снимок экрана текущего окна напрямую, минуя слой клавиатурных команд

source: There is no upper container
ru: Верхний контейнер отсутствует

source: Already framed
ru: Уже в рамке

source: The object cannot be framed.
ru: Объект не может быть помещён в рамку.

source: Frammed {object} {name}
ru: Обрамлён {object} {name}

source: from {startX}, {startY} to {endX}, {endY}
ru: от {startX}, {startY} до {endX}, {endY}

source: width {w} per height {h}
ru: ширина {w} на высоту {h}

source: The reference object is {objectRole} {objectName}
ru: Эталонным объектом является {objectRole} {objectName}

source: {ratio}% of the rectangle is occupied by the object of reference
ru: Эталонный объект занимает {ratio}% прямоугольника

source: The reference object is completely inside the rectangle
ru: Эталонный объект полностью находится внутри прямоугольника

source: Part of the reference object is outside the rectangle
ru: Часть эталонного объекта находится за пределами прямоугольника

source: The rectangle is inside the active window
ru: Прямоугольник находится внутри активного окна

source: Part of the rectangle is outside the active window
ru: Часть прямоугольника находится за пределами активного окна

source: The rectangle occupies {percentage}% of the screen
ru: Прямоугольник занимает {percentage}% экрана

source: No image to copy
ru: Нет изображения для копирования

source: Image copied to clipboard
ru: Изображение скопировано в буфер обмена

source: Unable to open the clipboard
ru: Не удаётся открыть буфер обмена

source: screenshot_{timestamp}.{ext}
ru: снимок экрана_{timestamp}.{ext}

source: Image was not saved
ru: Изображение не было сохранено

source: Save image
ru: Сохранить изображение

source: Top edge moved to
ru: Верхний край перемещён на

source: Left edge moved to
ru: Левый край перемещён на

source: Bottom edge moved to
ru: Нижний край перемещён на

source: Right edge moved to
ru: Правый край перемещён на

source: {msg} {width} per {height}
ru: {msg} {width} на {height}

source: Expanding,
ru: Расширение,

source: Shrinking,
ru: Уменьшение,

source: Already adjusted
ru: Уже настроено

source: Rectangle adjusted to {objectRole} {objectName}
ru: Прямоугольник настроен на {objectRole} {objectName}

source: could not be recognized. {reason}
ru: не может быть распознан. {reason}

source: The image is too small.
ru: Изображение слишком маленькое.

source: Press up arrow to frame the container object, space bar or numbers to know the rectangle information, enter key to take the screenshot or escape to cancel and exit. See the documentation for more commands.
ru: Нажмите стрелку вверх, чтобы выделить объект контейнера, пробел или цифры, чтобы узнать информацию о прямоугольнике, клавишу ввода, чтобы сделать снимок экрана, или escape для отмены и выхода. Дополнительные команды см. в документации.

source: Wrong gesture
ru: Неправильный жест

source: Reference object has changed
ru: Эталонный объект изменён

source: The reference object is fully inside the rectangle
ru: Эталонный объект полностью находится внутри прямоугольника

source: The reference object exceeds the bounds of the rectangle
ru: Эталонный объект выходит за границы прямоугольника

source: The rectangle has overflowed the active window
ru: Прямоугольник заполнил активное окно

source: object not found
ru: объект не найден

source: {step} px
ru: {step} пикселей

source: Select the folder where the image files of the screenshots will be saved
ru: Выберите папку, в которую будут сохраняться скриншоты

source: browse
ru: обзор

source: File format
ru: Формат файла

source: Enlarge small images
ru: Увеличивать маленькие изображения

source: After saving the screenshot
ru: После сохранения скриншота

source: Nothing
ru: Действие не требуется

source: Open file
ru: Открыть файл

source: Open folder
ru: Открыть папку

source: Movement unit (in pixels):
ru: Единица перемещения (в пикселях):

source: Choose a folder:
ru: Выберите папку:

source: screenshots wizard
ru: мастер создания скриншотов

source: Provides an wizard to take screenshots.
ru: Дополнение предоставляет мастер для создания скриншотов всего экрана или определённых его областей, таких как объекты, окна и т.д.
